app/controllers/decks_controller.rb

  def index
    @decks = current_user.decks.order(created_at: :desc) rescue Deck.where(owner_id: current_user.id).order(created_at: :desc)
---
SELECT "decks".* FROM "decks" WHERE "decks"."owner_id" = 3 ORDER BY "decks"."created_at" DESC

  def create
    @deck = Deck.new(deck_params)
    # Associate to current user. If your Deck model has belongs_to :owner, class_name: 'User'
    # you can use: @deck.owner = current_user
    # To be safe with current schema, set the foreign key directly:
    @deck.owner_id = current_user.id

    if @deck.save
---
INSERT INTO "decks" ("owner_id", "title", "description", "is_public", "created_at", "updated_at") VALUES (3, 'Tommy', 'tommy makes a deck', 0, '2025-10-31 16:08:51.504081', '2025-10-31 16:08:51.504081') RETURNING "id"

  def export
    @deck = (current_user.decks.find(params[:id]) rescue Deck.where(owner_id: current_user.id).find(params[:id]))

    # Generate the export content
    export_content = @deck.flashcards.map do |card|
---
SELECT "decks".* FROM "decks" WHERE "decks"."owner_id" = 3 AND "decks"."id" = 3 LIMIT 1

  def set_deck
    # Prefer association if present; fall back to owner_id filter
    @deck = (current_user.decks.find(params[:id]) rescue Deck.where(owner_id: current_user.id).find(params[:id]))
---
SELECT "decks".* FROM "decks" WHERE "decks"."owner_id" = 3 AND "decks"."id" = 3 LIMIT 1