app/controllers/flashcards_controller.rb

  def create
    @flashcard = @deck.flashcards.new(flashcard_params)
    if @flashcard.save
---
INSERT INTO "cards" ("deck_id", "card_type", "front_text", "back_text", "extras", "suspended", "created_at", "updated_at") VALUES (3, 0, 'Favourite restaurent', 'Viethoa', '{}', 0, '2025-10-31 16:09:16.122834', '2025-10-31 16:09:16.122834') RETURNING "id"

  def set_deck
    @deck = current_user.decks.find(params[:deck_id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = 3 LIMIT 1