app/controllers/learning_sessions_controller.rb

  def start
    # Initialize a new learning session
    @cards = @deck.flashcards.where(suspended: false).to_a.shuffle
---
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 3 AND "cards"."suspended" = 0

  def current_card
    card_ids = session[:learning_session]['card_ids']
    current_index = session[:learning_session]['current_index']

    # Ensure we don't go out of bounds
    if current_index >= card_ids.size
      return nil
    end

    card_id = card_ids[current_index]
    card = Flashcard.find_by(id: card_id)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = 2 LIMIT 1

  def record_review(card, rating)
    # Map text ratings to numeric values
    numeric_rating = case rating
    when 'unfamiliar' then 1
    when 'still_learning' then 2
    when 'mastered' then 4
    else 3
    end

    # Get time taken (you can track this in session if needed)
    time_taken_ms = 0 # Default to 0 for now

    # Get current progress if it exists
    progress = CardProgress.find_by(user: current_user, card: card)

    Review.create!(
      user: current_user,
      card: card,
      rating: numeric_rating,
      time_taken_ms: time_taken_ms,
      scheduled_interval_days: progress&.interval_days || 0,
      new_interval_days: calculate_new_interval(progress, numeric_rating),
      new_ease_factor: calculate_new_ease_factor(progress, numeric_rating),
      reviewed_at: Time.current
    )
---
SELECT "card_progresses".* FROM "card_progresses" WHERE "card_progresses"."user_id" = 1 AND "card_progresses"."card_id" = 2 LIMIT 1
INSERT INTO "reviews" ("user_id", "card_id", "rating", "time_taken_ms", "scheduled_interval_days", "new_interval_days", "new_ease_factor", "reviewed_at", "created_at", "updated_at") VALUES (1, 2, 4, 0, 0, 0, 2.5, '2025-11-01 07:54:32.009840', '2025-11-01 07:54:32.014694', '2025-11-01 07:54:32.014694') RETURNING "id", "reviewed_at"

  def update_card_progress(card, rating)
    progress = CardProgress.find_or_initialize_by(user: current_user, card: card)
---
SELECT "card_progresses".* FROM "card_progresses" WHERE "card_progresses"."user_id" = 1 AND "card_progresses"."card_id" = 2 LIMIT 1