app/controllers/progress_analytics_controller.rb

SELECT COUNT(*) AS "count_all", DATE(reviewed_at) AS "date_reviewed_at" FROM "reviews" WHERE "reviews"."user_id" = 1 AND "reviews"."reviewed_at" BETWEEN '2025-10-26 00:00:00' AND '2025-11-01 23:59:59.999999' GROUP BY DATE(reviewed_at)
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 1 ORDER BY "reviews"."reviewed_at" DESC LIMIT 5
---
  def index
    @total_cards    = current_user.card_progresses.count
    @due_now        = current_user.card_progresses.due_now.count
    @reviews_today  = current_user.reviews.where(reviewed_at: Time.zone.today.all_day).count

    last_30         = current_user.reviews.where('reviewed_at >= ?', 30.days.ago)