app/controllers/progress_analytics_controller.rb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 1
SELECT "cards".* FROM "cards" WHERE "cards"."id" IN (1, 3, 2)
SELECT DATE(reviewed_at) FROM "reviews" WHERE "reviews"."user_id" = 1
SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = 1
SELECT 1 AS one FROM "reviews" WHERE "reviews"."user_id" = 1 LIMIT 1
---
  def index
    @total_cards_studied = current_user.total_cards_studied
    @total_reviews = current_user.reviews.count
    @total_study_time = format_study_time(current_user.total_study_time)
    @study_streak = current_user.calculate_study_streak

    # Cards by state
    @new_cards = current_user.cards_by_state('new')
    @learning_cards = current_user.cards_by_state('learning')
    @review_cards = current_user.cards_by_state('review')
    @relearning_cards = current_user.cards_by_state('relearning')

    # Recent reviews (last 10)
    @recent_reviews = current_user.reviews.recent.limit(10).includes(card: :deck)

    # Reviews by day for the last 7 days
    @reviews_by_day = calculate_reviews_by_day(7)

    # Average rating
    @average_rating = current_user.reviews.any? ? current_user.reviews.average_rating : 0

SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = 1
SELECT COUNT(*) FROM "reviews" INNER JOIN "cards" ON "cards"."id" = "reviews"."card_id" WHERE "cards"."deck_id" = 1 AND "reviews"."user_id" = 1
SELECT AVG("reviews"."rating") FROM "reviews" INNER JOIN "cards" ON "cards"."id" = "reviews"."card_id" WHERE "cards"."deck_id" = 1 AND "reviews"."user_id" = 1
---
  def deck
    @deck = current_user.decks.find(params[:id])
    @deck_reviews = Review.for_deck(@deck).for_user(current_user)

    @total_cards = @deck.flashcards.count
    @cards_studied = @deck_reviews.select(:card_id).distinct.count
    @total_reviews = @deck_reviews.count
    @average_rating = @deck_reviews.any? ? @deck_reviews.average_rating : 0
    @total_study_time = format_study_time(@deck_reviews.total_study_time)

    # Cards by state for this deck
    @deck_progress = CardProgress.for_deck(@deck).for_user(current_user)
    @new_cards = @deck_progress.new_card.count
    @learning_cards = @deck_progress.learning.count
    @review_cards = @deck_progress.review.count
    @relearning_cards = @deck_progress.relearning.count

    # Recent reviews for this deck
    @recent_reviews = @deck_reviews.recent.limit(10).includes(:card)

SELECT COUNT(*) AS "count_all", DATE(reviewed_at) AS "date_reviewed_at" FROM "reviews" WHERE "reviews"."user_id" = 1 AND "reviews"."reviewed_at" BETWEEN '2025-10-26 00:00:00' AND '2025-11-01 23:59:59.999999' GROUP BY DATE(reviewed_at)
---
  def calculate_reviews_by_day(days)
    end_date = Date.current
    start_date = end_date - (days - 1).days

    reviews_by_date = current_user.reviews
                                   .between_dates(start_date.beginning_of_day, end_date.end_of_day)
                                   .group('DATE(reviewed_at)')
                                   .count

SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = 1
SELECT COUNT(DISTINCT "reviews"."card_id") FROM "reviews" INNER JOIN "cards" ON "cards"."id" = "reviews"."card_id" WHERE "cards"."deck_id" = 1 AND "reviews"."user_id" = 1
---
  def calculate_deck_stats
    current_user.decks.map do |deck|
      deck_progress = CardProgress.for_deck(deck).for_user(current_user)
      deck_reviews = Review.for_deck(deck).for_user(current_user)

      {
        deck: deck,
        total_cards: deck.flashcards.count,
        cards_studied: deck_reviews.select(:card_id).distinct.count,
        mastered: deck_progress.review.count,
        learning: deck_progress.learning.count,
        new: deck_progress.new_card.count