app/views/decks/index.html.erb

              <span class="deck-card-count">
                <%= deck.flashcards.count %> <%= deck.flashcards.count == 1 ? 'card' : 'cards' %>
---
SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = 3