app/views/decks/show.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 3
SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = 3
---
        <span class="metadata-item">
          <strong>Cards:</strong> <%= @deck.flashcards.count %>

SELECT 1 AS one FROM "cards" WHERE "cards"."deck_id" = 3 LIMIT 1
---

  <% if @deck.flashcards.any? %>

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 3
---
      <div class="flashcards-list">
        <% @deck.flashcards.each do |card| %>